<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Filament Admin Panel Path
    |--------------------------------------------------------------------------
    */

    'path' => 'admin',

    /*
    |--------------------------------------------------------------------------
    | Filament Auth Domain
    |--------------------------------------------------------------------------
    */

    'domain' => env('FILAMENT_DOMAIN'),

    /*
    |--------------------------------------------------------------------------
    | Filament Brand
    |--------------------------------------------------------------------------
    */

    'brand' => env('APP_NAME', 'PteroBilling'),

    /*
    |--------------------------------------------------------------------------
    | Filament Default Avatar Provider
    |--------------------------------------------------------------------------
    */

    'avatar_provider' => \Filament\AvatarProviders\GravatarProvider::class,

    /*
    |--------------------------------------------------------------------------
    | Filament Navigation
    |--------------------------------------------------------------------------
    */

    'navigation' => [
        'groups' => [
            'Пользователи' => ['heroicon-o-users'],
            'Продукты' => ['heroicon-o-shopping-bag'],
            'Заказы' => ['heroicon-o-shopping-cart'],
            'Серверы' => ['heroicon-o-server'],
            'Финансы' => ['heroicon-o-document-text'],
            'Маркетинг' => ['heroicon-o-ticket'],
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Filament Database Notifications
    |--------------------------------------------------------------------------
    */

    'database_notifications' => [
        'enabled' => true,
        'polling_interval' => '30s',
    ],

];
